In [1]:
import pandas as pd

In [3]:
data = {'apples':[3,2,0,1],'oranges':[0,3,7,2]}
df=pd.DataFrame(data,index=(['Nischal','Sakshyam','Amrit','Asmit']))

In [11]:
df.iloc[1]

apples     2
oranges    3
Name: Sakshyam, dtype: int64

In [8]:
data = {'col_1':[3,2,1,0],'col_2':['a','b','c','d']}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [9]:
data = {'col_1':[3,2,1,0],'col_2':['a','b','c','d']}
pd.DataFrame.from_dict(data,orient='index')

       0  1  2  3
col_1  3  2  1  0
col_2  a  b  c  d

In [10]:
data = {'col_1':[3,2,1,0],'col_2':['a','b','c','d']}
pd.DataFrame.from_dict(data,orient='index',columns=['A','B','C','D'])

       A  B  C  D
col_1  3  2  1  0
col_2  a  b  c  d

In [14]:
df=pd.read_csv('Housing.csv',index_col=0)

In [15]:
df.head()

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
price,,,,,,,,,,,,
13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [18]:
df.tail(2)

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
price,,,,,,,,,,,,
1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [17]:
#to read from json file
#df= pd.read_json('dataset.json')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 545 entries, 13300000 to 1750000
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   area              545 non-null    int64
 1   bedrooms          545 non-null    int64
 2   bathrooms         545 non-null    int64
 3   stories           545 non-null    int64
 4   mainroad          545 non-null    object
 5   guestroom         545 non-null    object
 6   basement          545 non-null    object
 7   hotwaterheating   545 non-null    object
 8   airconditioning   545 non-null    object
 9   parking           545 non-null    int64
 10  prefarea          545 non-null    object
 11  furnishingstatus  545 non-null    object
dtypes: int64(5), object(7)
memory usage: 55.4+ KB

In [20]:
df.shape

(545, 12)

In [23]:
df.describe()

               area    bedrooms   bathrooms     stories     parking
count    545.000000  545.000000  545.000000  545.000000  545.000000
mean    5150.541284    2.965138    1.286239    1.805505    0.693578
std     2170.141023    0.738064    0.502470    0.867492    0.861586
min     1650.000000    1.000000    1.000000    1.000000    0.000000
25%     3600.000000    2.000000    1.000000    1.000000    0.000000
50%     4600.000000    3.000000    1.000000    2.000000    0.000000
75%     6360.000000    3.000000    2.000000    2.000000    1.000000
max    16200.000000    6.000000    4.000000    4.000000    3.000000

In [24]:
df['area'].describe()

count      545.000000
mean      5150.541284
std       2170.141023
min       1650.000000
25%       3600.000000
50%       4600.000000
75%       6360.000000
max      16200.000000
Name: area, dtype: float64